import P from '@/components/typography/p';
import Ul from '@/components/typography/ul';
import Link from '@/components/ui/link';

const Rightholder = () => {
    return (
        <div className="px-6 py-4 md:p-0">
            <P className="mb-4">
                Якщо Ви помітили матеріал на нашому сайті, що порушує Ваші
                авторські права, або іншим чином дотичне до Вас, будь ласка,
                звʼяжіться з нами для розвʼязання цього питання. Для цього
                потрібно <strong>відправити лист</strong> на нашу електронну
                пошту, в якому міститься наступне:
            </P>
            <Ul className="mb-4">
                <li>посилання на спірний матеріал нашого сайту</li>
                <li>
                    контактні дані, для звʼязку з Вами завірені копії
                    документів, що підтверджують ваше право на матеріал
                </li>
            </Ul>
            <P className="mb-4">
                Адреса нашої електронної пошти{' '}
                <Link target="_blank" href="mailto:support@hikka.io">
                    support@hikka.io
                </Link>
            </P>
            <P className="mb-4">
                Ваш лист та предʼявлені документи будуть перевірені в найкоротші
                терміни, та з Вами звʼяжуться для урегулювання питання
                матеріалу. Увесь контент на нашому сайті отриманий з відкритих
                джерел та не для продажу, а служить тільки в ознайомчих цілях.
            </P>
        </div>
    );
};

export default Rightholder;
